# Задача 1: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

a = 190
summa1 = 0

while a > 0:
    x = a % 10
    summa1 = summa1 + x
    a = a // 10
else:
    print(summa1)
